In [6]:
import pandas as pd

### Series

In [3]:
list_var = ['a','b','c','d']

In [4]:
type(list_var)

list

In [5]:
series_var = pd.Series(list_var, index=[1,2,3,4])

In [6]:
series_var #series 는 값이 세로로, list 는 값이 가로로 표시

1    a
2    b
3    c
4    d
dtype: object

In [7]:
series_var[1]

'a'

In [8]:
type(series_var)

pandas.core.series.Series

In [9]:
series_var2 = pd.Series({1:'a',2:'b',3:'c',4:'d'})

In [10]:
series_var2

1    a
2    b
3    c
4    d
dtype: object

In [11]:
series_var2[1]

'a'

### DataFrame

- DataFrame = Series + Series + Series + Series + ...

In [7]:
df = pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],'age':['25','22','32'],
                   'gender':['F','F','M']})

In [8]:
df #세로 열들이 각각의 series

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [9]:
df['name']

0        yejin
1        jiwon
2    sanghyeon
Name: name, dtype: object

In [10]:
type(df['name'])

pandas.core.series.Series

In [11]:
df['age'] #age가 object로 되어있기 떄문에 int로 바꿔줘야함!!

0    25
1    22
2    32
Name: age, dtype: object

In [12]:
df.info() #Dtype에 3가지 (object(문자가 하나라도 포함되어있으면), int(정수), float(소수))

#dataframe을 info로 열고 1.항목들의 값의 의미를 파악 2.null값의 존재유무 3.Dtype확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [13]:
df.head() #head(5): 앞에서부터 5개만 가져와라   #tail(5): 뒤에서부터 5개만 가져와라

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [14]:
df.tail()

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [15]:
df ['age']= df['age'].astype(int) #df[]를 하지 않으면 바뀌지 않음.

In [16]:
print(df['age'].sum()) #합
print(df['age'].mean()) #평균
print(df['age'].median()) #중앙값
print(df['age'].max()) #최대
print(df['age'].min()) #최소
print(df['age'].std()) #표준편차
print(df['age'].var()) #분산

79
26.333333333333332
25.0
32
22
5.131601439446884
26.333333333333332

In [17]:
df.describe() #object를 제외한 나머지 값들을 다 계산해줌.

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [18]:
df.gender

0    F
1    F
2    M
Name: gender, dtype: object

In [19]:
df

        name  age gender
0      yejin   25      F
1      jiwon   22      F
2  sanghyeon   32      M

In [20]:
df[df['name'] =='jiwon']

    name  age gender
1  jiwon   22      F

In [21]:
df[(df['age']>20) | (df['gender'] =='F')] # &는 and , |는 or

        name  age gender
0      yejin   25      F
1      jiwon   22      F
2  sanghyeon   32      M

#### loc, iloc

In [22]:
#loc index기반, iloc 순서 기반

In [23]:
df = pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],'age':['25','22','32'],
                   'gender':[1,1,0]}, index=['a','b','c'])

In [24]:
df.loc['a'] #index상 'a'의 값

name      yejin
age          25
gender        1
Name: a, dtype: object

In [25]:
df.iloc[0] #순서상 '0'번째 값

name      yejin
age          25
gender        1
Name: a, dtype: object

In [26]:
df.iloc[0]['name']

'yejin'

In [27]:
df.iloc[0].age

'25'

In [28]:
df.loc['a']

name      yejin
age          25
gender        1
Name: a, dtype: object

In [29]:
df.iloc[0].name #index값을 가져와버림. #df에 있는 name함수를 불러오기 떄문에 의도한 name항목을 출력할 수 없음.

'a'

In [30]:
df.iloc[0]['name']

'yejin'

In [31]:
df.iloc[0]

name      yejin
age          25
gender        1
Name: a, dtype: object

In [32]:
df.iloc[0]['age']

'25'

In [33]:
df

        name age  gender
a      yejin  25       1
b      jiwon  22       1
c  sanghyeon  32       0

In [34]:
df.iloc[1]['gender']

1

In [35]:
df.iloc[0]['name']

'yejin'

In [36]:
df.iloc[2]['name']

'sanghyeon'

In [37]:
df.loc['c']

name      sanghyeon
age              32
gender            0
Name: c, dtype: object

In [38]:
df.loc['c']['gender']

0

#### DataFrame합치기

In [39]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                   'C':[9,10,11,12]})
df2 = pd.DataFrame({'A':[13,14,15,16],
                    'B':[17,18,19,20],
                   'C':[21,22,23,24]})

In [40]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [41]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [42]:
df3 = pd.concat([df1, df2])

In [45]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [43]:
df3 = df3.reset_index(drop=True) #index 다시!!

In [47]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [48]:
pd.concat([df1, df2], axis =1) #axis는 '축'을 의미. axis 0은 data를 가로로, 1은 세로로

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [49]:
df1['D'] =[13,14,15,16] #딕셔너리 항목 추가와 유사. #df의 column에 값 명명 후 리스트 값 추가.

In [50]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [51]:
df1.drop('A', axis=1, inplace =True) #inplace =True를 씀으로써 A행을 제거한 데이터프레임이 입력됨.

In [52]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [53]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [54]:
df4 = df1 + df2

In [55]:
df4 = pd.concat([df1, df2], axis=1)

In [56]:
df4

   B   C   D   A   B   C
0  5   9  13  13  17  21
1  6  10  14  14  18  22
2  7  11  15  15  19  23
3  8  12  16  16  20  24

#### Groupby (중요!)

In [57]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT','MSFT','FB','FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [58]:
df = pd.DataFrame(data)

In [59]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [61]:
df['Company'].value_counts() #수량을 알고 싶을 때

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [62]:
df['Company']

0    GOOG
1    GOOG
2    MSFT
3    MSFT
4      FB
5      FB
Name: Company, dtype: object

In [64]:
for com in df['Company'].unique():
    print(com, df[df['Company'] ==com] ['Sales'].mean())#unique는 중복값 제외. 고유값들만 가져옴

GOOG 160.0
MSFT 232.0
FB 296.5

In [65]:
print(df[df['Company'] =='GOOG']['Sales'].mean())
print(df[df['Company'] =='MSFT']['Sales'].mean())
print(df[df['Company'] =='FB']['Sales'].mean())#회사별 sales 값의 평균

160.0
232.0
296.5

In [66]:
df.groupby('Company') #'Company'를 가지고 그룹을 만들어라.

In [67]:
list(df.groupby('Company'))

[('FB',
    Company Person  Sales
  4      FB   Carl    243
  5      FB  Sarah    350),
 ('GOOG',
    Company   Person  Sales
  0    GOOG      Sam    200
  1    GOOG  Charlie    120),
 ('MSFT',
    Company    Person  Sales
  2    MSFT       Amy    340
  3    MSFT  Veanessa    124)]

In [68]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [70]:
df.columns #Columns 컬럼명으로 정렬! 컬럼명은 반드시 복붙 이용~!!

Index(['Company', 'Person', 'Sales'], dtype='object')

In [72]:
df.groupby('Company').mean() #계산 가능한 int값인 Sales값들만 출력

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [73]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [74]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [75]:
df.groupby(['Company','Person'])

In [76]:
df.groupby(['Company','Person']).min()

                  Sales
Company Person
FB      Carl        243
        Sarah       350
GOOG    Charlie     120
        Sam         200
MSFT    Amy         340
        Veanessa    124

In [78]:
df.shape

(6, 3)

In [79]:
df.groupby('Company').count() #Company의 행값들의 숫자

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [80]:
df.groupby('Company').describe() #describe 계산할 수 있는 다양한 수치를 계산

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [81]:
#정렬

df = pd.DataFrame({'수학점수':[65,80,60,80], 
                   '과학점수':[50,75,60,80],

                   '내신등급':[3,1,2,1]})

In [82]:
df

   수학점수  과학점수  내신등급
0    65    50     3
1    80    75     1
2    60    60     2
3    80    80     1

In [83]:
df.sort_values(by='수학점수') #수학점수를 기준으로 오름차순 정리

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [84]:
df.sort_values(by='수학점수', ascending = False) #수학점수를 기준으로 내림차순 정리

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [85]:
df.sort_values(by=['수학점수', '과학점수']) # 우선은 수학점수로 정렬 후 과학점수로 정렬!

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [86]:
df.sort_values(by=['수학점수', '과학점수'], ascending = [False,True]) #수학점수는 내림차순, 과학점수는 오름차순

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [87]:
df.sort_values(by=['수학점수', '과학점수'], ascending = [True, False]) #수학점수는 오름차순, 과학점수는 내림차순.

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
3    80    80     1
1    80    75     1